app/views/users/show.html.erb

        <td>
          <%= x.order.status %>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 3]]