app/views/orders/fulfillment.html.erb

  <p>
    <%= link_to "Order #{index+1}", user_order_path(@user.id, order.order_id), class: "btn btn-default" %>
---
SELECT  "orders".* FROM "orders" WHERE (1) LIMIT 1

  <p>
    Product: <%= link_to (Product.find(order.product_id).name), product_path, class: "btn btn-default" %>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 3]]

  <p>
    Status: <%= Order.find(order.order_id).status %>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]