app/views/orders/show.html.erb

    <tbody>
      <% @order.order_items.each do |x| %>
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 3]]