app/views/order_items/cart.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
---
<!-- move this logic "@order_items.count > 0" to view helper? -->
<% if @order && @order.order_items.count > 0 %>

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
---
          <%= form_for order_item, url: order_item_path(order_item), method: :put do |f| %>
            <%= f.number_field :quantity, in: 1..order_item.product.stock, step: 1, value: order_item.quantity %>