app/controllers/home_controller.rb

  def index
    @user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]