app/controllers/order_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "order_items" ("quantity", "product_id", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["quantity", 1], ["product_id", 1], ["order_id", 4], ["created_at", "2015-07-21 16:57:20.089300"], ["updated_at", "2015-07-21 16:57:20.089300"]]
INSERT INTO "orders" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-07-21 16:57:20.087311"], ["updated_at", "2015-07-21 16:57:20.087311"]]
---
    def create
    product = Product.find(params[:product_id])
    order = current_order

    order_item = order.order_items.new(quantity: params[:order_item][:quantity],
      product_id: product.id)
    order_item.save

SELECT  "order_items".* FROM "order_items" WHERE "order_items"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "order_items" WHERE "order_items"."id" = ?  [["id", 5]]
---
  def destroy
    order_item = OrderItem.find(params[:id])
    removed_product_name = order_item.product.name
    order_item.delete

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 4]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]
---
  def cart
    @order = Order.find_by(id: session[:order_id])
    @order_items = OrderItem.where(order_id: session[:order_id])