app/controllers/orders_controller.rb

  def show
    @order = Order.find(params[:id])
    @user_items = @current_user.order_items
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 3]]

  def fulfillment
    @user = User.find(params[:id])
    @order_items = @user.order_items
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 1]]

  def find_order
    @order = Order.find(session[:order_id])
    @order_items = @order.order_items
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 4]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 4]]