app/controllers/product_categories_controller.rb

  def create
    @product = Product.find(params[:product_id])
    ProductCategory.create(product_category_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "product_categories" ("product_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["category_id", 7], ["created_at", "2015-07-20 06:49:27.501926"], ["updated_at", "2015-07-20 06:49:27.501926"]]

  def destroy
    @product_category = ProductCategory.find(params[:id])
    category_name = @product_category.category.name
    @product_category.destroy

    # checks for if destroy goes wrong
    if @product_category
      flash[:errors] = "Something went wrong."
    else
      flash[:success] = "You have removed the category 'category_name'."
    end
    @product = Product.find(params[:product_id])
---
SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "product_categories" WHERE "product_categories"."id" = ?  [["id", 12]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]

  def create_category
    @category = Category.create(category_params)
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Toys"], ["created_at", "2015-07-22 17:20:09.719380"], ["updated_at", "2015-07-22 17:20:09.719380"]]