app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"
---
  def index
    @products = Product.all
    @categories = Category.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def merchant_index
    @merchant = User.find(params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products"  ORDER BY "products"."id" DESC LIMIT 1
---
  def new
    @product = Product.new
    @merchant = User.find(params[:user_id])
    @product_id = Product.last.id + 1

INSERT INTO "products" ("name", "price", "description", "active", "photo_url", "user_id", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.create(product_params)

SELECT "categories".* FROM "categories"
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 4]]
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."category_id" = ?  [["category_id", 4]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 2]]
---
  def category
    @merchant_products = nil
    @categories = Category.all
    if params[:category].empty?
      redirect_to products_path
    else
      @category = Category.find(params[:category])
      pro = @category.product_categories
      product_id_array = []
      pro.each do |item|
        product_id_array << item.product_id
      end
      @products_array = []
      products = product_id_array.each do |id|
        @products_array << Product.find(id)

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def merchant
    @products_array = []
    @merchants = User.all
    if params[:user].empty?
      redirect_to products_path
    else
      @merchant = User.find(params[:user])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @product = Product.find(params[:id])
    @reviews = @product.reviews
    @order_item = OrderItem.new
    @product_category = ProductCategory.new
    @user = User.find_by(id: session[:user_id])

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "active" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["active", "f"], ["updated_at", "2015-07-21 06:27:25.848232"], ["id", 1]]
---
  def toggle_active
    @product = Product.find(params[:id])
    @product.toggle_active!

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "stock" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock", 20], ["updated_at", "2015-07-20 19:04:34.244781"], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)