app/controllers/reviews_controller.rb

  def new
    @review = Review.new
    @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", nil]]

  def create
    @product = Product.find(params[:product_id])
    @review = Review.create(review_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "reviews" ("rating", "review_text", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["rating", 1], ["review_text", "nope"], ["product_id", 1], ["created_at", "2015-07-17 19:21:48.255851"], ["updated_at", "2015-07-17 19:21:48.255851"]]