app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "lol"]]
---
  def create
    @user = User.find_by(username: params[:session][:username])