app/views/products/edit.html.erb

        <%= f.select (:category_id), class: "form-control" do %>
          <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"