app/views/products/index.html.erb

  <div class="form-group inline-form">
    <%= select_tag "category", options_from_collection_for_select(Category.all, "id", "name"), include_blank: "Filter by...", class: "form-control fit-width" %>
---
SELECT "categories".* FROM "categories"

<%= form_tag products_merchant_path, method: "get" do %>
  <%= select_tag "user", options_from_collection_for_select(User.all, "id", "username") %>
---
SELECT "users".* FROM "users"