app/views/products/new.html.erb

SELECT "categories".* FROM "categories"
---
      <%= pc.label :category_id, class: "form-label" %>
      <%= pc.collection_select(:category_id, Category.all, :id, :name ) %>