app/views/products/show.html.erb

SELECT "categories".* FROM "categories"
---
    <ul class="list-inline">
      <% @product.categories.each do |category| %>